/** @file

;******************************************************************************
;* Copyright (c) 2014, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corporation.
;*
;******************************************************************************
*/

/=#

#string STR_HDD_PASSWORD_VAR_NAME                           #language en-US        "SetHddPassword"
                                                            #language fr-FR        "SetHddPassword"
                                                            #language zh-TW        "SetHddPassword"
                                                            #language ja-JP        "SetHddPassword"
                                                            #language it-IT        "SetHddPassword"
                                                            #language es-ES        "SetHddPassword"
                                                            #language de-DE        "SetHddPassword"
                                                            #language pt-PT        "SetHddPassword"
#string STR_MASTER_HDD_PASSWORD_VAR_NAME                    #language en-US        "SetMasterHddPassword"
                                                            #language fr-FR        "SetMasterHddPassword"
                                                            #language zh-TW        "SetMasterHddPassword"
                                                            #language ja-JP        "SetMasterHddPassword"
                                                            #language it-IT        "SetMasterHddPassword"
                                                            #language es-ES        "SetMasterHddPassword"
                                                            #language de-DE        "SetMasterHddPassword"
                                                            #language pt-PT        "SetMasterHddPassword"

#string STR_HDD_CHECK_PASSWORD_STRING   #language en-US        "Unlock HDD Security"
                                        #language fr-FR        "Déverrouiller(Annuler) la Sécurité de Disque Dur"
                                        #language zh-TW        "\wide解開硬碟安全鎖\narrow"
                                        #language ja-JP        "\wideドライブ\narrow0\wideのハードディスクはロックされています。\narrow"
                                        #language it-IT        "Sbloccare HDD Security"
                                        #language es-ES        "Seguridad Abierta de HDD"
                                        #language de-DE        "HDD Sicherheit freisetzen"
                                        #language pt-PT        "Destrancar HDD Segurança"
#string STR_HDD_PASSWORD_PROMPT         #language en-US        "Set Hdd Password"
                                        #language zh-TW        "\wide設定硬碟密碼\narrow"
                                        #language ja-JP        "\wideドライブ\narrow"
                                        #language fr-FR        "Déterminer Mot de Passe Hdd"
                                        #language it-IT        "Impostare password Hdd"
                                        #language es-ES        "Ajuste Contraseña de Hdd"
                                        #language de-DE        "HDD Kennwort einstellen"
                                        #language pt-PT        "Ajustar a HDD Senha"
#string STR_MASTER_HDD_PASSWORD_PROMPT  #language en-US        "Set Master Hdd Password"
                                        #language fr-FR        "Définir le mot de passe Disque Dur Maître"
                                        #language zh-TW        "\wide設定硬碟主碼\narrow"
                                        #language ja-JP        "\wideマスター\narrowHdd\wideパスワード設定\narrow"
                                        #language it-IT        "Imposta Password Hard Disk Master"
                                        #language es-ES        "Programar la contraseña del disco duro Master"
                                        #language de-DE        "Paßwortanlegung mit HDD-Meister"
                                        #language pt-PT        "Configura a senha de Master HDD"

#string STR_HDD_PASSWORD_PROMPT_1       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_HDD_PASSWORD_PROMPT_2       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_HDD_PASSWORD_PROMPT_3       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_HDD_PASSWORD_PROMPT_4       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_HDD_PASSWORD_PROMPT_5       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_HDD_PASSWORD_PROMPT_6       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_HDD_PASSWORD_PROMPT_7       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "
#string STR_HDD_PASSWORD_PROMPT_8       #language en-US        " "
                                        #language fr-FR        " "
                                        #language zh-TW        " "
                                        #language ja-JP        " "
                                        #language it-IT        " "
                                        #language es-ES        " "
                                        #language de-DE        " "
                                        #language pt-PT        " "

#string STR_HDD_PASSWORD_CBM_PROMPT_1       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_HDD_PASSWORD_CBM_PROMPT_2       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_HDD_PASSWORD_CBM_PROMPT_3       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_HDD_PASSWORD_CBM_PROMPT_4       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_HDD_PASSWORD_CBM_PROMPT_5       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_HDD_PASSWORD_CBM_PROMPT_6       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_HDD_PASSWORD_CBM_PROMPT_7       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_HDD_PASSWORD_CBM_PROMPT_8       #language en-US        " "
                                            #language fr-FR        " "
                                            #language zh-TW        " "
                                            #language ja-JP        " "
                                            #language it-IT        " "
                                            #language es-ES        " "
                                            #language de-DE        " "
                                            #language pt-PT        " "
#string STR_ONE_HDD_SECURITY_TITLE_HELP #language en-US        "Lock Harddisk and suggest the length of password greater than one character."
                                        #language fr-FR        "Verrouiller la Disque Dur et la longueur du mot de passe doit être supérieure à un caractère."
                                        #language zh-TW        "\wide設定硬碟密碼且建議密碼長度需大於一個字元\narrow"
                                        #language ja-JP        "\wideハードディスクをロックし、パスワードの文字数は一桁以上の必要がある\narrow"
                                        #language it-IT        "Blocca Hard Disk. La lunghezza della password deve essere maggiore di un carattere."
                                        #language es-ES        "Bloquear el disco duro y que el largo de la contraseña debe ser más grande que un carácter."
                                        #language de-DE        "Harddriveveriegelung und Paßwortlängemüssen mehr als ein Charakter sein"
                                        #language pt-PT        "Trava disco duro eo comprimento da senha deve ser superior a um personagem"
#string STR_ONE_HDD_MASTER_SECURITY_TITLE_HELP #language en-US        "Set master Harddisk password and suggest the length of password greater than one character."
                                               #language fr-FR        "Verrouiller la Disque Dur et la longueur du mot de passe doit être supérieure à un caractère."
                                               #language zh-TW        "\wide設定硬碟主碼且建議密碼長度需大於一個字元\narrow"
                                               #language ja-JP        "\wideハードディスクをロックし、パスワードの文字数は一桁以上の必要がある\narrow"
                                               #language it-IT        "Blocca Hard Disk. La lunghezza della password deve essere maggiore di un carattere."
                                               #language es-ES        "Bloquear el disco duro y que el largo de la contraseña debe ser más grande que un carácter."
                                               #language de-DE        "Harddriveveriegelung und Paßwortlängemüssen mehr als ein Charakter sein"
                                               #language pt-PT        "Trava disco duro eo comprimento da senha deve ser superior a um personagem"

#string STR_LOCK_ONE_HDD_SECURITY_TITLE_HELP #language en-US        "Input Harddisk password to unlock device."
                                             #language fr-FR        ""
                                             #language zh-TW        "\wide輸入硬碟密碼讓裝置解鎖\narrow"
                                             #language ja-JP        "\wide\narrow"
                                             #language it-IT        ""
                                             #language es-ES        ""
                                             #language de-DE        ""
                                             #language pt-PT        ""

#string STR_HDD_PSW_DISABLE             #language en-US        "Disable "
                                        #language fr-FR        "Désactiver "
                                        #language zh-TW        "\wide停用\narrow"
                                        #language ja-JP        "\wide使用しない\narrow"
                                        #language it-IT        "Disabilitare "
                                        #language es-ES        "Inhabilitar"
                                        #language de-DE        "Sperren"
                                        #language pt-PT        "Proibir"
#string STR_HDD_PSW_LOCK                #language en-US        "Lock    "
                                        #language fr-FR        "Fermer   "
                                        #language zh-TW        "\wide上鎖\narrow"
                                        #language ja-JP        "\wideロック\narrow"
                                        #language it-IT        "Blocco  "
                                        #language es-ES        "Cerrar  "
                                        #language de-DE        "Sperren"
                                        #language pt-PT        "Trancar"
#string STR_HDD_PSW_UNLOCK              #language en-US        "Unlock  "
                                        #language fr-FR        "Unfermer  "
                                        #language zh-TW        "\wide解鎖\narrow"
                                        #language ja-JP        "\wideアンロック\narrow"
                                        #language it-IT        "Sblocco "
                                        #language es-ES        "Abrir   "
                                        #language de-DE        "Entsperren"
                                        #language pt-PT        "Destrancar"
#string STR_HDD_PSW_CHANGE              #language en-US        "Change  "
                                        #language fr-FR        "Changer (Modifier)"
                                        #language zh-TW        "\wide更改\narrow"
                                        #language ja-JP        "\wide変更\narrow"
                                        #language it-IT        "Modifica"
                                        #language es-ES        "Cambios "
                                        #language de-DE        "ändern"
                                        #language pt-PT        "Mudar"
#string STR_IDE_SECURITY_MODE           #language en-US        "Security Mode: "
                                        #language fr-FR        "Mode de Securité: "
                                        #language zh-TW        "\wide安全模式\narrow:"
                                        #language ja-JP        "\wideセキュリティモード\narrow:"
                                        #language it-IT        "Modalita` sicurezza: "
                                        #language es-ES        "Modo de Seguridad: "
                                        #language de-DE        "Sicherheits-Modus:"
                                        #language pt-PT        "Segurança Modo:"
#string STR_HDD_PSW_NONACCESS           #language en-US        "No Accessed  "
                                        #language fr-FR        "Non Accédé   "
                                        #language zh-TW        "\wide禁止存取\narrow"
                                        #language ja-JP        "\wideアクセスなし\narrow"
                                        #language it-IT        "Accesso non riuscito"
                                        #language es-ES        "No acceso"
                                        #language de-DE        "Nicht Zugänglich"
                                        #language pt-PT        "Nenhum Acesso"
